Revit 2027 API
ParameterTypeId.SteelElemHoleSlotDirection Property
 "Along side 1"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemHoleSlotDirection { get; }
Public Shared ReadOnly Property SteelElemHoleSlotDirection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemHoleSlotDirection {
	ForgeTypeId^ get ();
}
static member SteelElemHoleSlotDirection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace